# Join

In [2]:
import pandas as pd

In [3]:
a=pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
a

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [4]:
a1=pd.DataFrame({"A1":[11,12,13,14],"B1":[15,16,17,18]})
a1

   A1  B1
0  11  15
1  12  16
2  13  17
3  14  18

In [5]:
a.join(a1)

   A  B  A1  B1
0  1  5  11  15
1  2  6  12  16
2  3  7  13  17
3  4  8  14  18

In [6]:
a2=pd.DataFrame({"C":[2,4],"D":[6,7]})
a2

   C  D
0  2  6
1  4  7

In [7]:
a.join(a2)

   A  B    C    D
0  1  5  2.0  6.0
1  2  6  4.0  7.0
2  3  7  NaN  NaN
3  4  8  NaN  NaN

In [8]:
a=pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]},index=['a','s','d','f'])
a2=pd.DataFrame({"C":[2,4],"D":[6,7]},index=['a','b'])
a.join(a2)

   A  B    C    D
a  1  5  2.0  6.0
s  2  6  NaN  NaN
d  3  7  NaN  NaN
f  4  8  NaN  NaN

In [9]:
a.join(a2,how="left")

   A  B    C    D
a  1  5  2.0  6.0
s  2  6  NaN  NaN
d  3  7  NaN  NaN
f  4  8  NaN  NaN

In [10]:
a.join(a2,how="right")

     A    B  C  D
a  1.0  5.0  2  6
b  NaN  NaN  4  7

In [11]:
a.join(a2,how="outer")

     A    B    C    D
a  1.0  5.0  2.0  6.0
b  NaN  NaN  4.0  7.0
d  3.0  7.0  NaN  NaN
f  4.0  8.0  NaN  NaN
s  2.0  6.0  NaN  NaN

In [12]:
a.join(a2,how="inner")

   A  B  C  D
a  1  5  2  6

In [13]:
a=pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]},index=['a','s','d','f'])
a2=pd.DataFrame({"C":[2,4],"B":[6,7]},index=['a','b'])
a.join(a2,lsuffix="_a",rsuffix="_b")

   A  B_a    C  B_b
a  1    5  2.0  6.0
s  2    6  NaN  NaN
d  3    7  NaN  NaN
f  4    8  NaN  NaN

# append

In [26]:
a = pd.DataFrame({"A": [1, 2, 3, 4], "B": [5, 6, 7, 8]}, index=['a', 's', 'd', 'f'])
a1 = pd.DataFrame({"C": [11, 12, 13, 14], "B": [15, 16, 17, 18]})
# a.append(a1)